rozkalnsandris/balcony-irrigation-esp32/src/main.cpp
#include <Arduino.h>
#include <WiFi.h>
#include <WiFiUdp.h>
#include <PubSubClient.h>
#include <ArduinoOTA.h>
#include <time.h>

#include "esp_task_wdt.h"
#include "esp_system.h"
#include "esp_timer.h"
#include "esp_arduino_version.h"

#include "secrets.h"
#include "command_safety.h"
#include "command_payload_policy.h"
#include "network_reconnect_policy.h"

#ifndef FIRMWARE_GIT_REV
#define FIRMWARE_GIT_REV "unknown"
#endif

// Palielina Arduino loop() task steku.
SET_LOOP_TASK_STACK_SIZE(16 * 1024);

// ============================================================
// PAMATA IESTATĪJUMI
// ============================================================

constexpr char MQTT_SERVER[] = "192.168.0.180";
constexpr uint16_t MQTT_PORT = 1883;

constexpr char MQTT_CLIENT_ID_BASE[] = "balkons_esp32";

constexpr char T_STATUS[]   = "balkons/status";
constexpr char T_PUMP_CMD[] = "balkons/sukna/komanda";
constexpr char T_PUMP_ST[]  = "balkons/sukna/stends";
constexpr char T_LOG[]      = "balkons/log";
constexpr char T_CMD[]      = "balkons/cmd";
constexpr char T_OUT[]      = "balkons/telegram_out";

constexpr char SYSLOG_SERVER[] = "192.168.0.180";
constexpr uint16_t SYSLOG_PORT = 514;

constexpr char NTP_SERVER_1[] = "pool.ntp.org";
constexpr char NTP_SERVER_2[] = "time.cloudflare.com";
constexpr char NTP_SERVER_3[] = "time.google.com";

constexpr char TZ_INFO[] = "CET-1CEST,M3.5.0,M10.5.0/3";

constexpr char OTA_HOSTNAME[] = "balkons-esp32";

// ============================================================
// DROŠĪBA / TAIMERI
// ============================================================

constexpr uint32_t DEFAULT_PUMP_SECONDS = 30;
constexpr uint32_t MAX_PUMP_SECONDS = 180;

constexpr uint32_t WDT_TIMEOUT_S = 30;

constexpr uint32_t WIFI_RECONNECT_INTERVAL_MS = 10000UL;
constexpr uint32_t MQTT_RECONNECT_INTERVAL_MS = 5000UL;
constexpr uint32_t MQTT_PUBLISH_INTERVAL_MS = 60000UL;
constexpr uint32_t MQTT_TCP_CONNECT_TIMEOUT_MS = 1000UL;

constexpr uint16_t MQTT_KEEPALIVE_S = 30;
constexpr uint16_t MQTT_SOCKET_TIMEOUT_S = 2;
constexpr uint16_t MQTT_BUFFER_SIZE = 1024;

// ============================================================
// PIN IESTATĪJUMI
// ============================================================

constexpr uint8_t RELAY_PIN = 26;

constexpr uint8_t MUX_S0 = 13;

// SVARĪGI:
// Pašlaik fiziskais vads tev ir uz GPIO12.
// Gala montāžā ieteicams pārvietot šo vadu uz GPIO25
// un tikai tad nomainīt šo vērtību no 12 uz 25.
constexpr uint8_t MUX_S1 = 12;

constexpr uint8_t MUX_S2 = 14;
constexpr uint8_t MUX_S3 = 27;

constexpr uint8_t MUX_SIG = 34;

constexpr uint8_t SENSOR_COUNT = 15;

// Relejs ir active-low.
constexpr uint8_t RELAY_ON = LOW;
constexpr uint8_t RELAY_OFF = HIGH;

// ============================================================
// MITRUMA KALIBRĀCIJA
// ============================================================

// Atskaites punkti:
// galīgi sauss ~2217
// vajag laistīt ~1850
// mitrs ~1175

constexpr int MOISTURE_DRY_THRESHOLD = 2000;
constexpr int MOISTURE_WET_THRESHOLD = 1400;

// ============================================================
// RTC ATMIŅA
// ============================================================

// Ja ESP32 restartējas laistīšanas laikā un RTC atmiņa saglabājas,
// pēc restarta varam brīdināt lietotāju.
RTC_DATA_ATTR bool rtcPumpWasRunning = false;

// ============================================================
// TĪKLS / MQTT
// ============================================================

WiFiClient mqttNet;
PubSubClient mqtt(mqttNet);
WiFiUDP udp;

char mqttClientId[48] = {0};

bool wifiOnline = false;
bool wifiEverConnected = false;

bool otaStarted = false;
bool timeConfigured = false;

bool pendingWiFiRestoredLog = false;
bool startupLogPending = true;
bool pumpWasRunningAtBoot = false;

uint32_t lastWiFiReconnectAttempt = 0;
uint32_t lastMqttReconnectAttempt = 0;
uint32_t lastMqttPublish = 0;

// ============================================================
// WATCHDOG
// ============================================================

bool watchdogSubscribed = false;

// ============================================================
// SŪKNIS
// ============================================================

bool pumpRunning = false;

// Absolūtais viena laistīšanas seansa sākums.
uint32_t pumpSessionStartMs = 0;

// Plānotais kopējais seansa ilgums no pumpSessionStartMs.
// Pagarinot laistīšanu, palielinām šo vērtību,
// bet nekad virs MAX_PUMP_SECONDS.
uint32_t pumpPlannedDurationMs = 0;

bool notifyPumpDone = false;

uint32_t lastRunSeconds = 0;

unsigned long totalWaterings = 0;
unsigned long totalPumpSeconds = 0;

time_t lastWateringTime = 0;

// ============================================================
// MQTT IENĀKOŠO KOMANDU RINDA
// ============================================================

constexpr uint8_t COMMAND_QUEUE_SIZE = 8;

struct PendingCommand {
  bool fromHA = false;
  uint32_t stopEpoch = 0;
  String payload;
};

PendingCommand commandQueue[COMMAND_QUEUE_SIZE];

uint8_t commandQueueHead = 0;
uint8_t commandQueueTail = 0;
uint8_t commandQueueCount = 0;

uint32_t oversizedCommandDrops = 0;

// Katrs urgent STOP/OFF palielina epoch. Parastās komandas saglabā
// epoch, kurā tās tika saņemtas, lai pēc jaunāka STOP varētu
// atmest tikai stale pump-start/extend komandas, nezaudējot statusa
// vai diagnostikas komandas.
uint32_t pumpStopEpoch = 0;

bool urgentPumpStopPending = false;
bool urgentPumpStopFromHA = false;

// ============================================================
// TELEGRAM IZEJOŠO ZIŅU RINDA
// ============================================================

// Ja MQTT īslaicīgi pazūd tieši sūkņa izslēgšanās brīdī,
// Telegram paziņojumu nezaudējam.
// Saglabājam un nosūtām pēc MQTT atjaunošanās.

constexpr uint8_t TELEGRAM_QUEUE_SIZE = 8;

String telegramQueue[TELEGRAM_QUEUE_SIZE];

uint8_t telegramQueueHead = 0;
uint8_t telegramQueueTail = 0;
uint8_t telegramQueueCount = 0;

// ============================================================
// PALĪGFUNKCIJAS
// ============================================================

String getTimeString() {
  time_t now = time(nullptr);

  // NTP vēl nav sinhronizējies.
  if (now < 1700000000) {
    return "nezināms laiks";
  }

  struct tm timeinfo;
  localtime_r(&now, &timeinfo);

  char buf[32];

