rozkalnsandris/balcony-irrigation-esp32/src/main.cpp
bool startPump(uint32_t seconds) {

  // Ja STOP/OFF tikko saņemts, vispirms jāpabeidz tā stāvokļa
  // reconciliācija. Tas nepieļauj pump startu vienā un tajā pašā
  // loop logā pirms urgent stop apstrādes.
  if (urgentPumpStopPending) {
    return false;
  }

  if (pumpRunning) {
    return false;
  }

  if (seconds == 0) {
    seconds = DEFAULT_PUMP_SECONDS;
  }

  if (seconds > MAX_PUMP_SECONDS) {
    seconds = MAX_PUMP_SECONDS;
  }

  uint32_t now = millis();

  digitalWrite(
    RELAY_PIN,
    RELAY_ON
  );

  pumpRunning = true;

  pumpSessionStartMs = now;

  pumpPlannedDurationMs =
      seconds * 1000UL;

  totalWaterings++;

  lastWateringTime =
      time(nullptr);

  rtcPumpWasRunning = true;

  logEvent(
    "Sūknis IESLĒGTS uz " +
    String(seconds) +
    " sek"
  );

  publishPumpStatus();

  tgSend(
    "💧 Laistīšana sākta! (" +
    String(seconds) +
    " sek)"
  );

  return true;
}

uint32_t extendPump(uint32_t additionalSeconds) {

  if (!pumpRunning) {
    return 0;
  }

  uint32_t maxDurationMs =
      MAX_PUMP_SECONDS * 1000UL;

  uint32_t requestedAddMs =
      additionalSeconds * 1000UL;

  uint32_t oldDurationMs =
      pumpPlannedDurationMs;

  uint64_t requestedDuration =
      static_cast<uint64_t>(
        pumpPlannedDurationMs
      ) +
      requestedAddMs;

  if (
      requestedDuration >
      maxDurationMs
  ) {
    pumpPlannedDurationMs =
        maxDurationMs;
  } else {
    pumpPlannedDurationMs =
        static_cast<uint32_t>(
          requestedDuration
        );
  }

  uint32_t actuallyAddedMs =
      pumpPlannedDurationMs -
      oldDurationMs;

  if (actuallyAddedMs > 0) {

    logEvent(
      "Sūkņa laiks PAGARINĀTS par " +
      String(actuallyAddedMs / 1000UL) +
      " sek; kopējais limits: " +
      String(pumpPlannedDurationMs / 1000UL) +
      " sek"
    );
  }

  return actuallyAddedMs / 1000UL;
}

void stopPump(
  const String& reason = "manuāli"
) {

  // Fiziski izslēdzam releju vienmēr,
  // pat ja programmatūra domā, ka sūknis jau OFF.
  digitalWrite(
    RELAY_PIN,
    RELAY_OFF
  );

  if (pumpRunning) {

    uint32_t elapsedMs =
        millis() -
        pumpSessionStartMs;

    lastRunSeconds =
        elapsedMs / 1000UL;

    totalPumpSeconds +=
        lastRunSeconds;

    notifyPumpDone = true;
  }

  pumpRunning = false;

  pumpPlannedDurationMs = 0;

  rtcPumpWasRunning = false;

  logEvent(
    "Sūknis IZSLĒGTS — " +
    reason
  );

  publishPumpStatus();
}

void servicePump() {

  if (!pumpRunning) {
    return;
  }

  uint32_t elapsedMs =
      millis() -
      pumpSessionStartMs;

  constexpr uint32_t hardLimitMs =
      MAX_PUMP_SECONDS * 1000UL;

  // Absolūtais drošības limits.
  // To nevar pagarināt ar komandām.
  if (elapsedMs >= hardLimitMs) {

    stopPump(
      "sasniegts maksimālais " +
      String(MAX_PUMP_SECONDS) +
      " sek limits"
    );

    return;
  }

  // Parastais ieplānotais izslēgšanas laiks.
  if (
      pumpPlannedDurationMs > 0 &&
      elapsedMs >= pumpPlannedDurationMs
  ) {

    stopPump(
      "plānotais laiks beidzies"
    );
  }
}

// ============================================================
// URGENT SŪKŅA STOP/OFF
// ============================================================

void requestUrgentPumpStop(bool fromHA) {

  // Drošības efekts notiek uzreiz callback kontekstā: tikai GPIO OFF.
  // MQTT publish/logging šeit apzināti neveicam, lai neizraisītu
  // PubSubClient re-entrancy.
  digitalWrite(
    RELAY_PIN,
    RELAY_OFF
  );

  pumpStopEpoch++;
  urgentPumpStopPending = true;
  urgentPumpStopFromHA = fromHA;
}

void serviceUrgentPumpStop() {

  if (!urgentPumpStopPending) {
    return;
  }

  bool fromHA = urgentPumpStopFromHA;

  urgentPumpStopPending = false;
  urgentPumpStopFromHA = false;

  if (pumpRunning) {

    stopPump(
      fromHA ?
      "Home Assistant OFF (urgent)" :
      "manuāla STOP komanda (urgent)"
    );

    return;
  }

  // Pat ja programmatūras stāvoklis jau bija OFF, uzturam fizisko
  // fail-safe stāvokli un atjaunojam retained MQTT statusu.
  digitalWrite(
    RELAY_PIN,
    RELAY_OFF
  );

  publishPumpStatus();

  if (!fromHA) {
    tgSend(
      "Sūknis jau bija izslēgts."
    );
  }
}

// Garāku sensoru lasījumu laikā pieņemam MQTT inputu, bet
// neuzsākam reconnect. Tas ļauj saņemt STOP/OFF starp sensoriem
// un tūlīt pēc mqtt.loop() atgriešanās pabeigt stop reconciliāciju.
void servicePumpCriticalNetworkInput() {

  if (mqtt.connected()) {
    mqtt.loop();
  }

  serviceUrgentPumpStop();
  servicePump();
  feedWatchdog();
}

// ============================================================
// OTA
// ============================================================

void setupOTA() {

  if (otaStarted) {
    return;
  }

  if (
      WiFi.status() !=
      WL_CONNECTED
  ) {
    return;
  }

  ArduinoOTA.setHostname(
    OTA_HOSTNAME
  );

  ArduinoOTA.setPassword(
    OTA_PASSWORD
  );

  ArduinoOTA.onStart([]() {

    // OTA laikā sūknis obligāti OFF.
    digitalWrite(
      RELAY_PIN,
      RELAY_OFF
    );

    pumpRunning = false;

    pumpPlannedDurationMs = 0;

    rtcPumpWasRunning = false;

    disableWatchdogForOTA();

    Serial.println(
      "OTA sākas — "
      "sūknis izslēgts, "
      "WDT atslēgts"
    );
  });

  ArduinoOTA.onEnd([]() {

    Serial.println(
      "\nOTA pabeigts — "
      "gaidu restartu"
    );
  });

  ArduinoOTA.onError(
    [](ota_error_t error) {

      Serial.println(
        "OTA kļūda #" +
        String(error)
      );

      // WDT OTA laikā tika noņemts.
      // Drošākais stāvoklis pēc neveiksmīga OTA
      // ir tīrs restarts ar releju OFF.
      digitalWrite(
        RELAY_PIN,
        RELAY_OFF
      );

      delay(250);

      ESP.restart();
    }
  );

  ArduinoOTA.begin();

  otaStarted = true;

  Serial.println(
    "OTA gatavs (" +
    WiFi.localIP().toString() +
    ")"
  );
}

// ============================================================
// LAIKA SINHRONIZĀCIJA
// ============================================================

void setupTimeOnce() {

  if (timeConfigured) {
    return;
  }

  // configTime(0, 0, ...) pārraksta TZ uz UTC.
  // Izmantojam configTzTime(), lai CET/CEST pārejas noteikumus
  // piemērotu arī pēc SNTP inicializācijas.
  configTzTime(
    TZ_INFO,
    NTP_SERVER_1,
    NTP_SERVER_2,
    NTP_SERVER_3
  );

