rozkalnsandris/balcony-irrigation-esp32/src/main.cpp
  timeConfigured = true;

  Serial.println(
    "NTP konfigurēts"
  );
}

// ============================================================
// Wi-Fi
// ============================================================

void setupWiFi() {

  WiFi.mode(
    WIFI_STA
  );

  WiFi.persistent(
    false
  );

  WiFi.setAutoReconnect(
    true
  );

  // Ierīce darbojas no pastāvīgas barošanas.
  // Atslēdzam Wi-Fi sleep, lai samazinātu
  // latentumu un nejaušus MQTT timeout.
  WiFi.setSleep(
    false
  );

  WiFi.setHostname(
    OTA_HOSTNAME
  );

  WiFi.begin(
    WIFI_SSID,
    WIFI_PASSWORD
  );

  lastWiFiReconnectAttempt =
      millis();

  Serial.println(
    "WiFi pieslēgšanās sākta..."
  );
}

void serviceWiFi() {

  bool connected =
      WiFi.status() ==
      WL_CONNECTED;

  if (connected) {

    if (!wifiOnline) {

      wifiOnline = true;

      Serial.println(
        "WiFi savienots! IP: " +
        WiFi.localIP().toString()
      );

      if (wifiEverConnected) {
        pendingWiFiRestoredLog = true;
      }

      wifiEverConnected = true;

      setupTimeOnce();
      setupOTA();
    }

    return;
  }

  // Tikko zaudējām Wi-Fi.
  if (wifiOnline) {

    wifiOnline = false;

    mqttNet.stop();

    Serial.println(
      "WiFi savienojums pazudis"
    );
  }

  uint32_t now =
      millis();

  if (
      now -
      lastWiFiReconnectAttempt >=
      WIFI_RECONNECT_INTERVAL_MS
  ) {

    lastWiFiReconnectAttempt =
        now;

    Serial.println(
      "Mēģinu atjaunot WiFi..."
    );

    // Nebloķējam loop().
    // ESP32 savienošanos turpina fonā.
    WiFi.reconnect();
  }
}

// ============================================================
// SENSORI
// ============================================================

void selectSensor(
  int channel
) {

  digitalWrite(
    MUX_S0,
    (channel >> 0) & 1
  );

  digitalWrite(
    MUX_S1,
    (channel >> 1) & 1
  );

  digitalWrite(
    MUX_S2,
    (channel >> 2) & 1
  );

  digitalWrite(
    MUX_S3,
    (channel >> 3) & 1
  );

  // Ļaujam MUX signālam stabilizēties.
  delay(10);

  // Pirmo ADC mērījumu pēc kanāla maiņas izmetam.
  analogRead(MUX_SIG);

  delay(5);
}

// Atgriež:
// -1 = sensors nav uzskatāms par pievienotu/stabilu
// citādi = RAW ADC vidējā vērtība.
int readMoistureRaw(
  int sensorIndex
) {

  selectSensor(
    sensorIndex
  );

  constexpr int SAMPLES = 10;

  int minVal = 4095;
  int maxVal = 0;

  long sum = 0;

  for (
      int i = 0;
      i < SAMPLES;
      i++
  ) {

    int value =
        analogRead(
          MUX_SIG
        );

    if (value < minVal) {
      minVal = value;
    }

    if (value > maxVal) {
      maxVal = value;
    }

    sum += value;

    delay(2);
  }

  int average =
      sum /
      SAMPLES;

  int spread =
      maxVal -
      minVal;

  // Ļoti nestabils signāls.
  if (spread > 200) {
    return -1;
  }

  // Praktiski ADC robeža.
  if (
      average < 100 ||
      average > 4090
  ) {
    return -1;
  }

  return average;
}

String categorizeMoisture(
  int raw
) {

  if (raw == -1) {
    return "";
  }

  if (
      raw >
      MOISTURE_DRY_THRESHOLD
  ) {
    return "sauss";
  }

  if (
      raw <
      MOISTURE_WET_THRESHOLD
  ) {
    return "mitrs";
  }

  return "videjs";
}

String categoryEmoji(
  const String& category
) {

  if (category == "sauss") {
    return "🔴";
  }

  if (category == "videjs") {
    return "🟡";
  }

  if (category == "mitrs") {
    return "🔵";
  }

  return "⚪";
}

// ============================================================
// MQTT KOMANDU RINDA
// ============================================================

void enqueueCommand(
  bool fromHA,
  const String& payload
) {

  // Ja rinda pilna, izmetam vecāko PARASTO komandu.
  // STOP/OFF šo FIFO vispār neizmanto.
  if (
      commandQueueCount >=
      COMMAND_QUEUE_SIZE
  ) {

    commandQueue[
      commandQueueHead
    ].payload = "";

    commandQueueHead =
        (commandQueueHead + 1) %
        COMMAND_QUEUE_SIZE;

    commandQueueCount--;

    Serial.println(
      "BRĪDINĀJUMS: komandu rinda pilna, "
      "vecākā komanda izmesta"
    );
  }

  commandQueue[
    commandQueueTail
  ].fromHA = fromHA;

  commandQueue[
    commandQueueTail
  ].stopEpoch = pumpStopEpoch;

  commandQueue[
    commandQueueTail
  ].payload = payload;

  commandQueueTail =
      (commandQueueTail + 1) %
      COMMAND_QUEUE_SIZE;

  commandQueueCount++;
}

bool dequeueCommand(
  PendingCommand& out
) {

  if (
      commandQueueCount == 0
  ) {
    return false;
  }

  out.fromHA =
      commandQueue[
        commandQueueHead
      ].fromHA;

  out.stopEpoch =
      commandQueue[
        commandQueueHead
      ].stopEpoch;

  out.payload =
      commandQueue[
        commandQueueHead
      ].payload;

  commandQueue[
    commandQueueHead
  ].payload = "";

  commandQueueHead =
      (commandQueueHead + 1) %
      COMMAND_QUEUE_SIZE;

  commandQueueCount--;

  return true;
}

// ============================================================
// HOME ASSISTANT DISCOVERY
// ============================================================

void sendDiscovery() {

  char topic[96];
  char payload[600];

  for (
      int sensor = 0;
      sensor < SENSOR_COUNT;
      sensor++
  ) {

    snprintf(
      topic,
      sizeof(topic),
      "homeassistant/sensor/"
      "balkons_puke%d/config",
      sensor + 1
    );

    snprintf(
      payload,
      sizeof(payload),

      "{"
      "\"name\":\"Puķe %d\","
      "\"stat_t\":\"balkons/puke%d/mitrums\","
      "\"exp_aft\":180,"
      "\"icon\":\"mdi:flower\","
      "\"uniq_id\":\"balkons_puke%d\","
      "\"avty_t\":\"balkons/status\","
      "\"dev\":{"
        "\"ids\":[\"balkons_esp32\"],"
        "\"name\":\"Balkona Laistīšana\","
        "\"mf\":\"Andris\","
        "\"mdl\":\"ESP32\""
      "}"
      "}",

      sensor + 1,
      sensor + 1,
      sensor + 1
    );

    mqtt.publish(
      topic,
      payload,
      true
    );

    feedWatchdog();

    delay(10);
  }

  snprintf(
    topic,
    sizeof(topic),
    "homeassistant/switch/"
    "balkons_sukna/config"
  );

  snprintf(
    payload,
    sizeof(payload),

    "{"
    "\"name\":\"Sūknis\","
    "\"cmd_t\":\"balkons/sukna/komanda\","
    "\"stat_t\":\"balkons/sukna/stends\","
    "\"pl_on\":\"ON\","
    "\"pl_off\":\"OFF\","
    "\"icon\":\"mdi:water-pump\","
    "\"uniq_id\":\"balkons_sukna\","
    "\"avty_t\":\"balkons/status\","
    "\"dev\":{"
      "\"ids\":[\"balkons_esp32\"],"
      "\"name\":\"Balkona Laistīšana\","
      "\"mf\":\"Andris\","
      "\"mdl\":\"ESP32\""
    "}"
    "}"
  );

  mqtt.publish(
    topic,
    payload,
    true
  );

  Serial.println(
    "MQTT discovery nosūtīts"
  );
}

