rozkalnsandris/balcony-irrigation-esp32/src/main.cpp
// ============================================================
// MQTT
// ============================================================

void mqttCallback(
  char* topic,
  byte* payload,
  unsigned int length
) {

  bool fromHA = false;
  bool recognizedTopic = false;

  if (
      strcmp(
        topic,
        T_PUMP_CMD
      ) == 0
  ) {

    fromHA = true;
    recognizedTopic = true;

  } else if (
      strcmp(
        topic,
        T_CMD
      ) == 0
  ) {

    recognizedTopic = true;
  }

  if (!recognizedTopic) {
    return;
  }

  // Komandu kontrakts ir ļoti mazs. Pārāk lielu payload atmetam
  // pirms dinamiska String allocation/copy, neizsaucot MQTT publish/log
  // callback kontekstā.
  if (
      !command_payload_policy::isCommandPayloadLengthAllowed(
        length
      )
  ) {

    oversizedCommandDrops++;

    Serial.printf(
      "BRĪDINĀJUMS: MQTT komanda par garu (%u > %u baiti)\n",
      length,
      static_cast<unsigned int>(
        command_payload_policy::kMaxCommandPayloadBytes
      )
    );

    return;
  }

  String message;

  message.reserve(
    length
  );

  for (
      unsigned int i = 0;
      i < length;
      i++
  ) {
    message +=
        static_cast<char>(
          payload[i]
        );
  }

  message.trim();

  if (
      command_safety::isUrgentStop(
        fromHA,
        message.c_str()
      )
  ) {

    requestUrgentPumpStop(
      fromHA
    );

    return;
  }

  enqueueCommand(
    fromHA,
    message
  );
}

void handleDeferredSystemLogs() {

  if (startupLogPending) {

    startupLogPending = false;

    logEvent(
      "Sistēma startēja — "
      "restarta iemesls: " +
      resetReasonStr() +
      ", brīvā atmiņa: " +
      String(
        ESP.getFreeHeap() /
        1024
      ) +
      " KB, firmware: " +
      String(FIRMWARE_GIT_REV)
    );

    if (pumpWasRunningAtBoot) {

      tgSend(
        "⚠️ Sistēma restartējās "
        "laistīšanas laikā. "
        "Sūknis TAGAD ir izslēgts. "
        "Pārbaudi manuāli, ja šaubies."
      );

      pumpWasRunningAtBoot = false;
    }
  }

  if (pendingWiFiRestoredLog) {

    pendingWiFiRestoredLog = false;

    logEvent(
      "WiFi ATJAUNOTS pēc pazušanas, "
      "IP: " +
      WiFi.localIP().toString() +
      ", signāls: " +
      String(
        WiFi.RSSI()
      ) +
      " dBm"
    );
  }
}

void connectMQTT() {

  if (
      WiFi.status() !=
      WL_CONNECTED
  ) {
    return;
  }

  if (
      mqtt.connected()
  ) {
    return;
  }

  Serial.println(
    "Mēģinu pieslēgt MQTT..."
  );

  bool connected =
      mqtt.connect(
        mqttClientId,
        MQTT_USERNAME,
        MQTT_PASSWORD,
        T_STATUS,
        0,
        true,
        "offline"
      );

  if (connected) {

    Serial.println(
      "MQTT savienots!"
    );

    mqtt.publish(
      T_STATUS,
      "online",
      true
    );

    // PubSubClient var abonēt ar QoS 1.
    mqtt.subscribe(
      T_PUMP_CMD,
      1
    );

    mqtt.subscribe(
      T_CMD,
      1
    );

    sendDiscovery();

    publishPumpStatus();

    logEvent(
      "MQTT savienots"
    );

    // Pēc reconnect uzreiz ļaujam
    // nosūtīt aktuālos sensoru datus.
    lastMqttPublish =
        millis() -
        MQTT_PUBLISH_INTERVAL_MS;

    handleDeferredSystemLogs();

    // Nosūtām Telegram ziņas,
    // kas gaidīja MQTT atjaunošanos.
    flushTelegramQueue();

  } else {

    static uint32_t lastFailLog = 0;

    int state =
        mqtt.state();

    Serial.println(
      "MQTT neizdevās, rc=" +
      String(state)
    );

    if (
        millis() -
        lastFailLog >=
        60000UL
    ) {

      lastFailLog =
          millis();

      // MQTT pats nav pieejams,
      // bet syslog caur UDP vēl var strādāt.
      logEvent(
        "MQTT savienojums NEIZDEVĀS, rc=" +
        String(state)
      );
    }
  }
}

void serviceMQTT() {

  bool wifiConnected =
      WiFi.status() ==
      WL_CONNECTED;

  bool mqttConnected =
      mqtt.connected();

  if (!wifiConnected) {
    return;
  }

  if (mqttConnected) {

    mqtt.loop();

    return;
  }

  uint32_t now =
      millis();

  // Ja sūknis darbojas, jaunu TCP/MQTT reconnect nemaz nesākam.
  // Esošu veselīgu MQTT sesiju turpinām apkalpot augstāk ar mqtt.loop(),
  // lai urgent STOP/OFF joprojām var pienākt nekavējoties.
  if (
      !network_policy::shouldAttemptMqttReconnect(
        wifiConnected,
        mqttConnected,
        pumpRunning,
        now,
        lastMqttReconnectAttempt,
        MQTT_RECONNECT_INTERVAL_MS
      )
  ) {
    return;
  }

  lastMqttReconnectAttempt =
      now;

  // Reconnect notiek tikai ar sūkni OFF. TCP connect ir 1 s limits;
  // PubSubClient MQTT atbildes logs paliek 2 s, tātad viena OFF-state
  // reconnect mēģinājuma nominālā augšējā robeža ir ~3 s plus neliels
  // scheduler/tīkla overhead. Pump-running laikā šis ceļš netiek sākts.
  connectMQTT();
}

// ============================================================
// MQTT MITRUMA PUBLICĒŠANA
// ============================================================

void publishMoisture() {

  if (
      !mqtt.connected()
  ) {
    return;
  }

  char topic[48];

  for (
      int sensor = 0;
      sensor < SENSOR_COUNT;
      sensor++
  ) {

    int raw =
        readMoistureRaw(
          sensor
        );

    servicePumpCriticalNetworkInput();

    String category =
        categorizeMoisture(
          raw
        );

    if (
        category.length() ==
        0
    ) {
      continue;
    }

    snprintf(
      topic,
      sizeof(topic),
      "balkons/puke%d/mitrums",
      sensor + 1
    );

    mqtt.publish(
      topic,
      category.c_str()
    );

    // Sensora lasīšanas laikā arī pārbaudām
    // sūkņa lokālo taimeri.
    servicePump();
  }

  Serial.println(
    "MQTT mitrums nosūtīts"
  );
}

// ============================================================
// KOMANDAS
// ============================================================

void processHACommand(
  String command
) {

