rozkalnsandris/balcony-irrigation-esp32/src/main.cpp
  command.trim();

  if (
      command ==
      "ON"
  ) {

    if (!pumpRunning) {

      startPump(
        MAX_PUMP_SECONDS
      );
    }

  } else if (
      command ==
      "OFF"
  ) {

    if (pumpRunning) {

      stopPump(
        "Home Assistant OFF"
      );
    }
  }
}

void processCommand(
  String command
) {

  command.trim();

  logEvent(
    "Komanda (MQTT): " +
    command
  );

  // ----------------------------------------------------------
  // /laist
  // ----------------------------------------------------------

  if (
      command ==
      "laist"
  ) {

    if (pumpRunning) {

      uint32_t added =
          extendPump(
            DEFAULT_PUMP_SECONDS
          );

      if (added > 0) {

        tgSend(
          "💧 Sūknis jau darbojas — "
          "pagarinu par " +
          String(added) +
          " sekundēm!"
        );

      } else {

        tgSend(
          "⚠️ Sūknim jau sasniegts "
          "maksimālais " +
          String(
            MAX_PUMP_SECONDS
          ) +
          " sekunžu limits."
        );
      }

    } else {

      startPump(
        DEFAULT_PUMP_SECONDS
      );
    }
  }

  // ----------------------------------------------------------
  // /laist_X
  // ----------------------------------------------------------

  else if (
      command.startsWith(
        "laist_"
      )
  ) {

    int minutes =
        command
          .substring(6)
          .toInt();

    int maxMinutes =
        MAX_PUMP_SECONDS /
        60;

    if (
        minutes > 0 &&
        minutes <= maxMinutes
    ) {

      uint32_t requestedSeconds =
          static_cast<uint32_t>(
            minutes
          ) *
          60UL;

      if (pumpRunning) {

        uint32_t added =
            extendPump(
              requestedSeconds
            );

        if (added > 0) {

          tgSend(
            "💧 Laistīšana pagarināta par " +
            String(added) +
            " sek!"
          );

        } else {

          tgSend(
            "⚠️ Jau sasniegts maksimālais " +
            String(
              MAX_PUMP_SECONDS
            ) +
            " sekunžu limits."
          );
        }

      } else {

        startPump(
          requestedSeconds
        );
      }

    } else {

      tgSend(
        "❌ Ievadi 1-" +
        String(
          maxMinutes
        ) +
        " minūtes"
      );
    }
  }

  // ----------------------------------------------------------
  // /stop
  // ----------------------------------------------------------

  else if (
      command ==
      "stop"
  ) {

    if (pumpRunning) {

      stopPump(
        "manuāla STOP komanda"
      );

    } else {

      tgSend(
        "Sūknis jau bija izslēgts."
      );
    }
  }

  // ----------------------------------------------------------
  // /mitrums
  // ----------------------------------------------------------

  else if (
      command ==
      "mitrums"
  ) {

    String result =
        "🌱 Mitruma stāvoklis:\n\n";

    result.reserve(
      600
    );

    int activeCount = 0;

    for (
        int sensor = 0;
        sensor < SENSOR_COUNT;
        sensor++
    ) {

      int raw =
          readMoistureRaw(
            sensor
          );

      servicePumpCriticalNetworkInput();

      String category =
          categorizeMoisture(
            raw
          );

      if (
          category.length() ==
          0
      ) {

        result +=
            "Puķe " +
            String(
              sensor + 1
            ) +
            ": nav pievienots\n";

      } else {

        result +=
            categoryEmoji(
              category
            ) +
            " Puķe " +
            String(
              sensor + 1
            ) +
            ": " +
            category +
            "\n";

        activeCount++;
      }
    }

    result +=
        "\nAktīvi sensori: " +
        String(
          activeCount
        ) +
        "/" +
        String(
          SENSOR_COUNT
        );

    tgSend(
      result
    );
  }

  // ----------------------------------------------------------
  // /raw
  // ----------------------------------------------------------

  else if (
      command ==
      "raw"
  ) {

    String result =
        "🔧 RAW ADC vērtības:\n\n";

    result.reserve(
      500
    );

    for (
        int sensor = 0;
        sensor < SENSOR_COUNT;
        sensor++
    ) {

      selectSensor(
        sensor
      );

      long sum = 0;

      for (
          int i = 0;
          i < 10;
          i++
      ) {

        sum +=
            analogRead(
              MUX_SIG
            );

        delay(2);
      }

      int average =
          sum /
          10;

      servicePumpCriticalNetworkInput();

      result +=
          "Puķe " +
          String(
            sensor + 1
          ) +
          ": " +
          String(
            average
          ) +
          "\n";
    }

    tgSend(
      result
    );
  }

  // ----------------------------------------------------------
  // /statuss
  // ----------------------------------------------------------

  else if (
      command ==
      "statuss"
  ) {

    String status =
        "⚙️ Statuss:\n";

    status.reserve(
      640
    );

    status +=
        "Sūknis: " +
        String(
          pumpRunning ?
          "🟢 Darbojas" :
          "🔴 Izslēgts"
        ) +
        "\n";

    if (pumpRunning) {

      uint32_t elapsedMs =
          millis() -
          pumpSessionStartMs;

      uint32_t remainingMs = 0;

      if (
          pumpPlannedDurationMs >
          elapsedMs
      ) {

        remainingMs =
            pumpPlannedDurationMs -
            elapsedMs;
      }

      // Noapaļojam uz augšu,
      // lai 14999 ms rādītu 15 sek.
      uint32_t remainingSeconds =
          (
            remainingMs +
            999UL
          ) /
          1000UL;

      status +=
          "Atlikušais laiks: " +
          String(
            remainingSeconds
          ) +
          " sek\n";
    }

    if (
        WiFi.status() ==
        WL_CONNECTED
    ) {

      status +=
          "WiFi: " +
          WiFi.localIP().toString() +
          "\n";

      status +=
          "Signāls: " +
          String(
            WiFi.RSSI()
          ) +
          " dBm\n";

    } else {

      status +=
          "WiFi: 🔴 atvienots\n";
    }

    status +=
        "MQTT: " +
        String(
          mqtt.connected() ?
          "🟢 savienots" :
          "🔴 atvienots"
        ) +
        "\n";

    status +=
        "Brīvā atmiņa: " +
        String(
          ESP.getFreeHeap() /
          1024
        ) +
        " KB\n";

    status +=
        "Min. brīvā atmiņa: " +
        String(
          ESP.getMinFreeHeap() /
          1024
        ) +
        " KB\n";

    status +=
        "Lielākais heap bloks: " +
        String(
          ESP.getMaxAllocHeap() /
          1024
        ) +
        " KB\n";

    status +=
        "Loop steks min. brīvs: " +
        String(
          static_cast<unsigned long>(
            uxTaskGetStackHighWaterMark(
              nullptr
            )
          )
        ) +
        " B\n";

    status +=
        "Pārāk garas komandas: " +
        String(
          oversizedCommandDrops
        ) +
        "\n";

    status +=
        "Laiks: " +
        getTimeString() +
        "\n";

    status +=
        "Firmware: " +
        String(FIRMWARE_GIT_REV) +
        "\n";

    status +=
        "Uptime: " +
        getUptimeString();

    tgSend(
      status
    );
  }

  // ----------------------------------------------------------
  // /statistika
  // ----------------------------------------------------------

  else if (
      command ==
      "statistika"
  ) {

