rozkalnsandris/balcony-irrigation-esp32/src/main.cpp
    String stats =
        "📊 Statistika:\n\n";

    stats +=
        "Laistīšanas reizes: " +
        String(
          totalWaterings
        ) +
        "\n";

    stats +=
        "Kopējais sūkņa laiks: " +
        String(
          totalPumpSeconds
        ) +
        " sek\n";

    if (
        lastWateringTime >
        1700000000
    ) {

      struct tm timeinfo;

      localtime_r(
        &lastWateringTime,
        &timeinfo
      );

      char buf[32];

      strftime(
        buf,
        sizeof(buf),
        "%d.%m.%Y %H:%M:%S",
        &timeinfo
      );

      stats +=
          "Pēdējā laistīšana: " +
          String(buf);
    }

    tgSend(
      stats
    );
  }

  // ----------------------------------------------------------
  // Nezināma komanda
  // ----------------------------------------------------------

  else {

    tgSend(
      "❓ Nezināma komanda: " +
      command
    );
  }
}

void processCommandQueue() {

  PendingCommand item;

  // Vienā loop ciklā apstrādājam vienu komandu.
  // Tas neļauj lielai komandbumbai pārāk ilgi
  // aizturēt tīkla un sūkņa drošības funkcijas.
  if (
      !dequeueCommand(
        item
      )
  ) {
    return;
  }

  if (
      command_safety::shouldSuppressQueuedPumpStart(
        item.stopEpoch,
        pumpStopEpoch,
        item.fromHA,
        item.payload.c_str()
      )
  ) {

    logEvent(
      "Drošība: stale pump-start komanda atmesta pēc jaunāka STOP/OFF"
    );

    return;
  }

  if (item.fromHA) {

    processHACommand(
      item.payload
    );

  } else {

    processCommand(
      item.payload
    );
  }
}

// ============================================================
// SETUP
// ============================================================

void setup() {

  Serial.begin(
    115200
  );

  delay(100);

  // ----------------------------------------------------------
  // Relejs VISPIRMS droši OFF.
  // ----------------------------------------------------------

  pinMode(
    RELAY_PIN,
    OUTPUT
  );

  digitalWrite(
    RELAY_PIN,
    RELAY_OFF
  );

  // Saglabājam informāciju par iepriekšējo restartu,
  // bet uzreiz notīrām RTC flagu, jo sūknis jau ir OFF.
  pumpWasRunningAtBoot =
      rtcPumpWasRunning;

  rtcPumpWasRunning =
      false;

  // ----------------------------------------------------------
  // MUX
  // ----------------------------------------------------------

  pinMode(
    MUX_S0,
    OUTPUT
  );

  pinMode(
    MUX_S1,
    OUTPUT
  );

  pinMode(
    MUX_S2,
    OUTPUT
  );

  pinMode(
    MUX_S3,
    OUTPUT
  );

  pinMode(
    MUX_SIG,
    INPUT
  );

  // Explicit 12-bit ADC.
  // Tavi pašreizējie sliekšņi ir kalibrēti 0-4095 diapazonam.
  analogReadResolution(
    12
  );

  // ----------------------------------------------------------
  // Watchdog
  // ----------------------------------------------------------

  setupWatchdog();

  // ----------------------------------------------------------
  // Unikāls MQTT Client ID
  // ----------------------------------------------------------

  uint64_t chipId =
      ESP.getEfuseMac();

  snprintf(
    mqttClientId,
    sizeof(mqttClientId),
    "%s-%06llX",
    MQTT_CLIENT_ID_BASE,
    static_cast<unsigned long long>(
      chipId &
      0xFFFFFFULL
    )
  );

  Serial.println(
    "MQTT Client ID: " +
    String(
      mqttClientId
    )
  );

  // ----------------------------------------------------------
  // MQTT
  // ----------------------------------------------------------

  // Arduino-ESP32 NetworkClient noklusējums ir 3000 ms.
  // Mūsu lokālajam brokerim to skaidri ierobežojam līdz 1000 ms.
  mqttNet.setConnectionTimeout(
    MQTT_TCP_CONNECT_TIMEOUT_MS
  );

  mqtt.setServer(
    MQTT_SERVER,
    MQTT_PORT
  );

  mqtt.setBufferSize(
    MQTT_BUFFER_SIZE
  );

  mqtt.setKeepAlive(
    MQTT_KEEPALIVE_S
  );

  mqtt.setSocketTimeout(
    MQTT_SOCKET_TIMEOUT_S
  );

  mqtt.setCallback(
    mqttCallback
  );

  // ----------------------------------------------------------
  // Wi-Fi
  // ----------------------------------------------------------

  setupWiFi();

  Serial.println(
    "Sistēma startēta. "
    "Gaidu WiFi/MQTT... 🌱"
  );
}

// ============================================================
// LOOP
// ============================================================

void loop() {

  feedWatchdog();

  // Ja urgent STOP palicis no iepriekšējā tīkla callback,
  // tas vienmēr dominē pirms jebkura cita loop darba.
  serviceUrgentPumpStop();

  // Sūkņa drošību pārbaudām pašā loop sākumā.
  servicePump();

  // ----------------------------------------------------------
  // Wi-Fi
  // ----------------------------------------------------------

  serviceWiFi();

  // ----------------------------------------------------------
  // OTA
  // ----------------------------------------------------------

  if (
      otaStarted &&
      WiFi.status() ==
      WL_CONNECTED
  ) {

    ArduinoOTA.handle();
  }

  // ----------------------------------------------------------
  // MQTT
  // ----------------------------------------------------------

  serviceMQTT();

  // mqtt.loop() varēja pieņemt urgent STOP/OFF. Relejs callbackā
  // jau tika fiziski izslēgts; šeit nekavējoties sakārtojam state,
  // statistiku, logus un retained statusu pirms parastās FIFO.
  serviceUrgentPumpStop();

  // Pēc iespējami bloķējoša tīkla mēģinājuma
  // vēlreiz pārbaudām sūkņa laiku.
  servicePump();

  // ----------------------------------------------------------
  // MQTT komandas
  // ----------------------------------------------------------

  processCommandQueue();

  // Komanda varēja ieslēgt vai izslēgt sūkni.
  servicePump();

  // ----------------------------------------------------------
  // Periodiska mitruma publicēšana
  // ----------------------------------------------------------

  if (
      mqtt.connected() &&
      millis() -
      lastMqttPublish >=
      MQTT_PUBLISH_INTERVAL_MS
  ) {

    lastMqttPublish =
        millis();

    publishMoisture();
  }

  // ----------------------------------------------------------
  // Pabeigtas laistīšanas paziņojums
  // ----------------------------------------------------------

  if (
      notifyPumpDone
  ) {

    notifyPumpDone =
        false;

    tgSend(
      "✅ Laistīšana pabeigta! (" +
      String(
        lastRunSeconds
      ) +
      " sek)"
    );
  }

  // ----------------------------------------------------------
  // Ja MQTT ir atgriezies, mēģinām iztukšot
  // atlikušās Telegram ziņas.
  // ----------------------------------------------------------

  if (
      mqtt.connected() &&
      telegramQueueCount > 0
  ) {

    flushTelegramQueue();
  }

  // Īss yield sistēmas taskiem.
  delay(1);
}
